🚧 [OpenTofu plan](https://opentofu.org) 🚧

```txt
module.region["lab01"].local_file.version: Refreshing state... [id=dde54fd2095f6fb1fabc34058c5b0d741dc73384]
module.region["lab01"].talos_machine_secrets.this: Refreshing state... [id=machine_secrets]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.region["lab01"].local_file.version will be created
  + resource "local_file" "version" {
      + content              = "v1.9.3"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/home/runner/work/homelab/homelab/deploy/tofu/out/lab01"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```